/*
* Создайте функцию-комбинатор с именем flip, которая принимает
* функцию в качестве аргумента и возвращает эту функцию с обратными аргументами.

Например:

flip(print)(4,5) // возвращает "5 -> 4"
function print(a,b) {
   return a + " -> " + b;
}
*
Идея состоит в том, чтобы перевернуть любое количество аргументов, используя функцию более высокого порядка, не заботясь о том, какая функция передается в нее.
* */

function flip(){
   let func = arguments[0];
	return function()
   {
    	return func.apply(null, Array.from(arguments).reverse());
   };
}

module.exports = flip